perf/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - pause: 30
    - name: Ramp up
      duration: 60
      arrivalRate: 5
      rampTo: 100
    - name: Plain
      duration: 120
      arrivalRate: 100
    - name: Stress
      duration: 120
      arrivalRate: 100
      rampTo: 300
    - pause: 30
    


scenarios:
  - name: Metar (/metar)
    flow:
      - get: 
          url: '/metar'